Tekla Open API Reference for Tekla Structures 2025
PropertiesDialog Properties
The PropertiesDialog type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from FormBase.)
Top
See Also
Reference
PropertiesDialog Class
Tekla.Structures.Dialog.UIControls Namespace